.cf.xml/DataProcessors/обм_ПакетыДанных_Обработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>обм_ПакетыДанных_Обработка</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Приемники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПакетДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбоаботчикЗаполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработкаБезЗаполненияПриемника</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОшибкаПриОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники_ЗагруженныеПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники_ЗагруженныеПакетыДанных</Name>
			<Comment>Хранит связь между ссылкой приемника и объектом входящего запроса, откуда были взяты данные для заполения приемника</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Это должен быть ресурс, но нужен флаг "Ведущее".</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/Catalogs/обм_ПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>обм_ПакетыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПерезаписиПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказСозданияНовогоПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/DataProcessors/обм_ПакетыДанных_Обработка/Ext/ObjectModule.bsl
Перем	мОбработкаВыполнена;
Перем	мОшибки;
Перем	мПриемниковЗаполнено;
Перем	мСчетчикПакетовДанных;

#Область ПрограммныйИнтерфейс

Функция ЕстьОшибки() Экспорт
	
	Возврат мОшибки.Количество() > 0;
	
КонецФункции

Функция КоличествоОшибок() Экспорт
	
	Возврат мОшибки.Количество();
	
КонецФункции

Функция Приемник_Заполнить(пПриемникСсылка, пПакетДанных, пОбработчик, пЗаписыватьПриемника = Истина) Экспорт
	
	приемникОбъект = ПакетДанных_Обработать(пПакетДанных);
	объектСсылкаДругое = общ.ОбъектСсылкаДругое(приемникОбъект);
		
	Если объектСсылкаДругое = "Объект" Тогда
		// Ок, так и надо
			
	ИначеЕсли объектСсылкаДругое = "Ссылка" Тогда
		приемникОбъект = приемникОбъект.ПолучитьОбъект();
			
	Иначе
		Возврат Неопределено;
			
	КонецЕсли;

	Если пЗаписыватьПриемника Тогда
		Приемник_Записать(приемникОбъект, пПакетДанных);
		
	КонецЕсли;
	
	Возврат приемникОбъект;
	
КонецФункции

Функция ПакетДанных_Обработать(пакетДанныхСсылка) Экспорт
	
	приемникОбъект = Неопределено;

	Попытка
		интерфейсЗагрузчика = Обработки.обм_ИнтерфейсОбработчиков_ПакетыДанных_Обработка.Создать();
		реализацияИнтерфейса = Справочники.общ_Обработчики.ОбработчикОдиночка(пакетДанныхСсылка.Обработчик);
		общ.Интерфейс_УстановитьРеализацию(интерфейсЗагрузчика, реализацияИнтерфейса);
		
		приемникОбъект = интерфейсЗагрузчика.ПакетДанных_Обработать(пакетДанныхСсылка);
		
		мСчетчикПакетовДанных = мСчетчикПакетовДанных + 1;
			
		// Если обработчик не возвращает приемника, а только выполняет какой-то код
		Если приемникОбъект = Неопределено Тогда
			мОбработкаВыполнена = мОбработкаВыполнена + 1;
			
		КонецЕсли;
			
		Если общ.ОбъектСсылкаДругое(приемникОбъект) = "Объект" И приемникОбъект.Модифицированность() Тогда
			Приемник_Записать(приемникОбъект, пакетДанныхСсылка);
			
			// В процедуре Приемник_ПослеЗаписи выполнять проведение документов и обработку связанных с приемником данных
			интерфейсЗагрузчика.Приемник_ПослеЗаписи(приемникОбъект, пакетДанныхСсылка);
			
		КонецЕсли;
		

	Исключение
		комментОшибки = ИнформацияОбОшибке();
		Ошибка_ВЖурнал(
			"ПакетДанных.Обработка",
			комментОшибки, 
			пакетДанныхСсылка.Обработчик,
			пакетДанныхСсылка // Данные заполнения
			);
				
		мОшибки.Добавить(комментОшибки);
			
	КонецПопытки;

	Возврат приемникОбъект;

КонецФункции

Функция ПримечаниеОЗагрузке() Экспорт
	
	строкиПримечания = Новый Массив;

	Если мСчетчикПакетовДанных = 0 Тогда
		строкиПримечания.Добавить("Нет объектов для обработки");
		
	ИначеЕсли мСчетчикПакетовДанных = 1 Тогда  
		
		Если мОбработкаВыполнена Тогда
			строкиПримечания.Добавить("Обработка выполнена");
			
		ИначеЕсли мПриемниковЗаполнено Тогда
			строкиПримечания.Добавить("Приемник заполнен");
			
		Иначе
			строкиПримечания.Добавить("Непонятный результат");
			
		КонецЕсли;
		
	ИначеЕсли мСчетчикПакетовДанных > 1 Тогда 
		
		Если мОбработкаВыполнена Тогда
			строкиПримечания.Добавить(СтрШаблон("%1 %2;", "Обработка выполнена", мОбработкаВыполнена));
			
		КонецЕсли;
		
		Если мПриемниковЗаполнено Тогда
			строкиПримечания.Добавить(СтрШаблон("%1 %2;", "Заполнено", мПриемниковЗаполнено));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьОшибки() Тогда
		строкиПримечания.Добавить(Символы.ПС);
		строкиПримечания.Добавить("При обработке были ошибки. Подробности см. в журнале регистрации");

		Для Каждого инфоОшибки Из мОшибки Цикл
			краткоеОшибки = общ.Ошибка_КраткоеПредставление(инфоОшибки);
			строкиПримечания.Добавить(краткоеОшибки);
			
		КонецЦикла;
		инфоОшибки = Неопределено;
		
	КонецЕсли;
	
	примечание = СтрСоединить(строкиПримечания, Символы.ПС);
	
	Возврат примечание;
	
КонецФункции

// @TODO 250715 Заяш: Предполагается исползовать в подключаемых обработчиках
// Если не будет использовано, удалить
Функция Приемник_ЗаполненБолееНовымиДанными(пПакетДанных, пПриемникСсылка) Экспорт
	
	ответПоУмолчанию = Ложь;
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пПакетДанных, Тип("СправочникСсылка.обм_ПакетыДанных")) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пПриемникСсылка) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("пПакетДанных", пПакетДанных);
	Запрос.УстановитьПараметр("ПриемникСсылка", пПриемникСсылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПоследнееЗаполнение.ПакетДанных = ДЗ.Ссылка
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(ПоследнееЗаполнение.ДатаВремя, &ПустаяДата) > ЕСТЬNULL(ДЗ.ДатаВремя, &ПустаяДата)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Ложь
	|	КОНЕЦ КАК Результат
	|ИЗ
	|	РегистрСведений.обм_Приемники_ЗагруженныеПакетыДанных.СрезПоследних(, Приемник = &Приемник) КАК ПоследнееЗаполнение,
	|	Справочник.обм_ПакетыДанных КАК ДЗ
	|ГДЕ
	|	ДЗ.Ссылка = &пПакетДанных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Результат;
		
	КонецЕсли;
	
	Возврат ответПоУмолчанию;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	
	мОбработкаВыполнена = 0;
	мОшибки = Новый Массив;
	мПриемниковЗаполнено = 0;
	мСчетчикПакетовДанных = 0;
	
КонецПроцедуры

Процедура Ошибка_ВЖурнал(
	пИмяСобытия,
	пКомментарийОшибки, 
	пОбработчикСсылка = Неопределено, 
	пПакетДанных = Неопределено
	)
	
	имяСобытия = обм.ИмяСобытияЖурналаРегистрации(пИмяСобытия);
	
	ссылкиДанных = Новый Массив;
	ссылкиДанных.Добавить(пОбработчикСсылка);
	ссылкиДанных.Добавить(пПакетДанных);
	
	входящееСообщениеСсылка = общ.ЗначениеРеквизитаОбъекта(пПакетДанных, "Владелец");
	ссылкиДанных.Добавить(входящееСообщениеСсылка);
	
	общ.Ошибка_ВЖурналРегистрации(имяСобытия, пКомментарийОшибки, ссылкиДанных);
	
КонецПроцедуры

Функция Приемник_Записать(пПриемникОбъект, пПакетДанных)
	
	объектСсылкаДругое = общ.ОбъектСсылкаДругое(пПриемникОбъект);
	Если объектСсылкаДругое <> "Объект" Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	пПриемникОбъект.ДополнительныеСвойства.Вставить("УзелОтправитель", пПакетДанных.Узел);
	пПриемникОбъект.ДополнительныеСвойства.Вставить("Категория", пПакетДанных.Категория);
	пПриемникОбъект.ДополнительныеСвойства.Вставить("Идентификатор", пПакетДанных.Идентификатор);
	
	Если общ.КорневойТипКонфигурации(пПриемникОбъект) = "Документ" Тогда
		Если пПриемникОбъект.ПометкаУдаления Тогда
			пПриемникОбъект.Проведен = Ложь;
			
		КонецЕсли;
		
		пПриемникОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	Иначе // Все кроме документов
		пПриемникОбъект.Записать();
		
	КонецЕсли;

	приемникСсылка = пПриемникОбъект.Ссылка;
	
	// Установить ссылку на загруженный объект в регистр сведений входящих документов
	РегистрыСведений.обм_Приемники.Записать(
						пПакетДанных.Узел,
						пПакетДанных.Категория,
						пПакетДанных.Идентификатор,
						приемникСсылка,
						пПакетДанных.Комментарий,
						пПакетДанных
						);

	// Установить связь между ссылкой приемником и загруженными данными
	РегистрыСведений.обм_Приемники_ЗагруженныеПакетыДанных.Связать(приемникСсылка, пПакетДанных);
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

Инициализировать();
